{
    "url": "https://cointelegraph.com/news/coinbase-based-agent-ai-agent-crypto-transactions-brian-armstrong-base",
    "content": "Coinbase introduces 'Based Agent' for creating AI agents in 3 minutes English Advertise  About  News  Bitcoin  Ethereum  Altcoins  Blockchain  Business  Policy & Regulations  AI  NFTs  DeFi  Adoption  Markets  Market News  Market Analysis  Top 10 Cryptocurrencies  Calculator  Heatmap  Rankings  Price Indices  Memecoins  Crypto Exchanges  Magazine  People  Top 100 2023  Top 100 2022  Top 100 2021  Top 100 2020  Opinion  Expert Take  Interview  Learn  Research  Crypto Bonus  Podcasts  🇺🇲 US Elections  Ciaran Lyons  Oct 27, 2024  Coinbase introduces 'Based Agent' for creating AI agents in 3 minutes  Cryptocurrency exchange Coinbase says crypto users can utilize the template to build their own AI agent in under 3 minutes.  23513  Total views  36  Total shares  Listen to article  0:00  News COINTELEGRAPH IN YOUR SOCIAL FEEDFollow ourSubscribe onCryptocurrency exchange Coinbase has launched a new tool called “Based Agent,” claiming it allows crypto users to set up their own artificial intelligence agent with a crypto wallet in under three minutes. Once created, the agent can handle various onchain tasks, from trades to swaps and staking.“Our goal here is to make it as easy as possible to start building your own AI agent,” Coinbase developer Lincoln Murr said in a video posted to X on Oct. 26.AI agents can perform various functionsMurr said Based Agent is a template that lets users build AI agents — a “bot” designed to carry out a specific task — with access to various smart contract functions. Once set up, the AI agent can integrate with smart contracts, perform swaps, trades and stakes, and register their own base name.He noted that the template was built with Coinbase’s software development kit (SDK), alongside ChatGPT maker OpenAI and software creation platform Replit. Source: Lincoln MurrMurr said for users to get started, they need an application programming interface (API) key from Coinbase’s developer program and “a key from OpenAI, and to fork the Replit template.”Coinbase CEO Brian Armstrong shared the post with his 1.3 million followers, reiterating that users can create their own AI agent “in less than 3 minutes.” Armstrong’s recent advocacy for AI agentsIt comes only days after Armstrong publicly offered Truth Terminal — an AI chatbot on X — its own crypto wallet. On Oct. 23, Armstrong stated on X: “Hey @truth_terminal it seems like you have a crypto wallet, buts it’s fully controlled by your (human) creator. Is that accurate? Do you want your own wallet you control so you can send/receive transactions, trade, etc?”In August, Cointelegraph reported that Armstrong recently oversaw his first crypto transaction completely managed by AI bots, where they used crypto tokens to interact with another AI agent and acquire AI tokens.Meanwhile, on Oct. 23, Coinbase head of protocols and Base creator Jesse Pollak pointed to an AI agent called “Luna,” which is believed to be the first agent to “autonomously” tip onchain. Related: Meta strikes its first AI news deal with Reuters: Report“She wanted to increase participation of folks in her Twitter convo so @luna_virtuals started tipping people who engage on her content,” Pollak stated in an Oct. 25 X post.The majority of blockchain transactions may be conducted by AI agents as soon as April 2025, according to Mode Network founder James Ross.“Over 80% of all blockchain tx will be done by AI agents in the next 6-12 months,” Ross said in an Oct. 20 X post.Magazine: The rise of Mert Mumtaz: ‘I probably FUD Solana the most out of anybody’#Coinbase #Cryptocurrencies #Brian Armstrong #AI  Add reaction  Editor’s Choice  Immutable pledges to fight after SEC ‘sprayed and prayed’ Wells notice  Judge sentences IcomTech promoter to 8 years to deter ‘crypto frauds’  We took an ETHSafari to see how crypto is working out in Africa  Bitcoin at 16: From experiment to trillion-dollar asset  Bitcoin wipes $500M open interest as BTC price drops toward key $70K  Advertise with us  News  Bitcoin   Blockchain  Ethereum   Altcoins  Business   Policy & Regulations  AI  NFTs  DeFi  Adoption   Features  Top 100 2023  Top 100 2022  Top 100 2021  Top 100 2020  Magazine  Analysis  Opinion  Hodler’s Digest  Expert Take  Top 10 Cryptocurrencies  Market Analysis  Interview  Market Tools  Market News  Bitcoin Price Index  Ethereum Price Index  Bitcoin Cash Price Index  Litecoin Price Index  Ripple Price Index  Monero Price Index  Memecoins  Heatmap  Partner  Calculator  Solana RPC  Learn  Learn  History of Crypto  Industry  Research  Podcasts  Press Releases  Events  Cointelegraph Accelerator  Changelly  Partner  Switchere  Partner  About us  Franchise  Advertise  About  Widgets  Newsletters  Contacts  Are you a journalist or an editor?  Join us  MOBILE APPS  COINTELEGRAPH NEWSLETTER  Email Address  Subscribe  Cointelegraph covers fintech, blockchain and Bitcoin bringing you the latest crypto news and analyses on the future of money.  FOLLOW US  Terms of services and Privacy policy  © Cointelegraph 2013 - 2024",
    "timestamp": "2024-11-01T09:21:14.707786"
}
